Infineon/REF_MTB_LV_Ceiling_Fan/CF_SL_FOC_XMC13/PMSM_FOC/MIDSys/pmsm_foc_pwmsvm.c
        /* To trigger ADC at centre of active segments T1 and T2. */
        ADC.ADC3Trig_Point = T0_000 + (T1 >> 1);    // For ADC 3 trigger.
      //ADC.ADC4Trig_Point = T0_000 + T1 + (T2 >> 1); // For ADC 4 trigger.
        ADC.ADC4Trig_Point = CCU8_PERIOD_2ND - (T0_000) - (T2 >> 1); // For ADC 4 trigger.
        break;

      case 1: /*Sector B */
        CCU8_MODULE_PHASE_U->CR1S = TZ_PZV;
        CCU8_MODULE_PHASE_U->CR2S = Period_T0_111 - T1;
        CCU8_MODULE_PHASE_V->CR1S = 0;
        CCU8_MODULE_PHASE_V->CR2S = TZ_PZVX2 + T0_000;
        CCU8_MODULE_PHASE_W->CR1S = TZ_PZVX2;
        CCU8_MODULE_PHASE_W->CR2S = Period_T0_111;

        /* To trigger ADC at centre of active segments T1 and T2. */
        ADC.ADC3Trig_Point = T0_000 + (T2 >> 1);
        //ADC.ADC4Trig_Point = T0_000 + T2 + (T1 >> 1);
        ADC.ADC4Trig_Point = CCU8_PERIOD_2ND - (T0_000) - (T1 >> 1); // For ADC 4 trigger.
        break;

      case 2: /* Sector C */
        CCU8_MODULE_PHASE_U->CR1S = TZ_PZVX2;
        CCU8_MODULE_PHASE_U->CR2S = Period_T0_111;
        CCU8_MODULE_PHASE_V->CR1S = 0;
        CCU8_MODULE_PHASE_V->CR2S = TZ_PZVX2 + T0_000;
        CCU8_MODULE_PHASE_W->CR1S = TZ_PZV;
        CCU8_MODULE_PHASE_W->CR2S = Period_T0_111 - T2;

        /* To trigger ADC at centre of active segments T1 and T2. */
        ADC.ADC3Trig_Point = T0_000 + (T1 >> 1);
        //ADC.ADC4Trig_Point = T0_000 + T1 + (T2 >> 1);
        ADC.ADC4Trig_Point = CCU8_PERIOD_2ND - (T0_000) - (T2 >> 1); // For ADC 4 trigger.
        break;

      case 3: /* Sector D */
        CCU8_MODULE_PHASE_U->CR1S = TZ_PZVX2;
        CCU8_MODULE_PHASE_U->CR2S = Period_T0_111;
        CCU8_MODULE_PHASE_V->CR1S = TZ_PZV;
        CCU8_MODULE_PHASE_V->CR2S = Period_T0_111 - T1;
        CCU8_MODULE_PHASE_W->CR1S = 0;
        CCU8_MODULE_PHASE_W->CR2S = TZ_PZVX2 + T0_000;

        /* To trigger ADC at centre of active segments T1 and T2. */
        ADC.ADC3Trig_Point = T0_000 + (T2 >> 1);
//        ADC.ADC4Trig_Point = T0_000 + T2 + (T1 >> 1);
        ADC.ADC4Trig_Point = CCU8_PERIOD_2ND - (T0_000) - (T1 >> 1); // For ADC 4 trigger.

        break;

      case 4: /* Sector E */
        CCU8_MODULE_PHASE_U->CR1S = TZ_PZV;
        CCU8_MODULE_PHASE_U->CR2S = Period_T0_111 - T2;
        CCU8_MODULE_PHASE_V->CR1S = TZ_PZVX2;
        CCU8_MODULE_PHASE_V->CR2S = Period_T0_111;
        CCU8_MODULE_PHASE_W->CR1S = 0;
        CCU8_MODULE_PHASE_W->CR2S = TZ_PZVX2 + T0_000;

        /* To trigger ADC at centre of active segments T1 and T2. */
        ADC.ADC3Trig_Point = T0_000 + (T1 >> 1);
        //ADC.ADC4Trig_Point = T0_000 + T1 + (T2 >> 1);
        ADC.ADC4Trig_Point = CCU8_PERIOD_2ND - (T0_000) - (T2 >> 1); // For ADC 4 trigger.
        break;

      default: /* Process for all other cases, Sector F = 5. */
        CCU8_MODULE_PHASE_U->CR1S = 0;
        CCU8_MODULE_PHASE_U->CR2S = TZ_PZVX2 + T0_000;
        CCU8_MODULE_PHASE_V->CR1S = TZ_PZVX2;
        CCU8_MODULE_PHASE_V->CR2S = Period_T0_111;
        CCU8_MODULE_PHASE_W->CR1S = TZ_PZV;
        CCU8_MODULE_PHASE_W->CR2S = Period_T0_111 - T1;

        /* To trigger ADC at centre of active segments T1 and T2. */
        ADC.ADC3Trig_Point = T0_000 + (T2 >> 1);
        //ADC.ADC4Trig_Point = T0_000 + T2 + (T1 >> 1);
        ADC.ADC4Trig_Point = CCU8_PERIOD_2ND - (T0_000) - (T1 >> 1); // For ADC 4 trigger.
        break;
    }
  }
  else
  {
    SVM.SVM_Flag = SVM_USE_STANDARD;
    CCU80_CC83->PRS = PERIOD_REG;

    T1nT2 = T1 + T2; /* Temp variable for (T1+T2) <= PERIOD_REG. */
    if (T1nT2 > PERIOD_REG)
    {
      T1nT2 = PERIOD_REG; /* Make sure below T0/2 >= 0. */
    }

    HalfT0 = (PERIOD_REG - T1nT2) >> 1U;

    /* Standard 4-segment PWM: */
    switch (SVM.CurrentSectorNo)
    {
      case 0: /* Sector A */
        CCU8_MODULE_PHASE_U->CR1S = 0U;
        CCU8_MODULE_PHASE_U->CR2S = (uint32_t) HalfT0;

        CCU8_MODULE_PHASE_V->CR1S = 0U;
        CCU8_MODULE_PHASE_V->CR2S = (uint32_t) HalfT0 + T1;

        CCU8_MODULE_PHASE_W->CR1S = 0U;
        CCU8_MODULE_PHASE_W->CR2S = (uint32_t) (PERIOD_OF_PWM + T1nT2) >> 1U;

        CCU80_CC83->CR1S = HalfT0 + (T1 >> 1);      // For ADC trigger at centre of active segments T1 and T2.
        CCU80_CC83->CR2S = HalfT0 + T1 + (T2 >> 1);
        break;
      case 1: /* Sector B */
        CCU8_MODULE_PHASE_U->CR1S = 0U;
        CCU8_MODULE_PHASE_U->CR2S = (uint32_t) HalfT0 + T2;

        CCU8_MODULE_PHASE_V->CR1S = 0U;
        CCU8_MODULE_PHASE_V->CR2S = (uint32_t) HalfT0;

        CCU8_MODULE_PHASE_W->CR1S = 0U;
        CCU8_MODULE_PHASE_W->CR2S = (uint32_t) (PERIOD_OF_PWM + T1nT2) >> 1U;

        CCU80_CC83->CR1S = HalfT0 + (T2 >> 1);      // For ADC trigger at centre of active segments T1 and T2.
        CCU80_CC83->CR2S = HalfT0 + T2 + (T1 >> 1);

        break;
      case 2: /* Sector C */
        CCU8_MODULE_PHASE_U->CR1S = 0U;
        CCU8_MODULE_PHASE_U->CR2S = (uint32_t) (PERIOD_OF_PWM + T1nT2) >> 1U;

        CCU8_MODULE_PHASE_V->CR1S = 0U;
        CCU8_MODULE_PHASE_V->CR2S = (uint32_t) HalfT0;

        CCU8_MODULE_PHASE_W->CR1S = 0U;
        CCU8_MODULE_PHASE_W->CR2S = (uint32_t) HalfT0 + T1;

        CCU80_CC83->CR1S = HalfT0 + (T1 >> 1);      // For ADC trigger at centre of active segments T1 and T2.
        CCU80_CC83->CR2S = HalfT0 + T1 + (T2 >> 1);

        break;
      case 3: /* Sector D */
        CCU8_MODULE_PHASE_U->CR1S = 0U;
        CCU8_MODULE_PHASE_U->CR2S = (uint32_t) (PERIOD_OF_PWM + T1nT2) >> 1U;

        CCU8_MODULE_PHASE_V->CR1S = 0U;
        CCU8_MODULE_PHASE_V->CR2S = (uint32_t) HalfT0 + T2;

        CCU8_MODULE_PHASE_W->CR1S = 0U;
        CCU8_MODULE_PHASE_W->CR2S = (uint32_t) HalfT0;

        CCU80_CC83->CR1S = HalfT0 + (T2 >> 1);      // For ADC trigger at centre of active segments T1 and T2.
        CCU80_CC83->CR2S = HalfT0 + T2 + (T1 >> 1);

        break;
      case 4: /* Sector E */
        CCU8_MODULE_PHASE_U->CR1S = 0U;
        CCU8_MODULE_PHASE_U->CR2S = (uint32_t) HalfT0 + T1;

        CCU8_MODULE_PHASE_V->CR1S = 0U;
        CCU8_MODULE_PHASE_V->CR2S = (uint32_t) (PERIOD_OF_PWM + T1nT2) >> 1U;

