Infineon/REF_MTB_LV_Ceiling_Fan/CF_SL_FOC_XMC13/PMSM_FOC/MIDSys/pmsm_foc_pwmsvm.c
        CCU8_MODULE_PHASE_W->CR1S = 0U;
        CCU8_MODULE_PHASE_W->CR2S = (uint32_t) HalfT0;

        CCU80_CC83->CR1S = HalfT0 + (T1 >> 1);      // For ADC trigger at centre of active segments T1 and T2.
        CCU80_CC83->CR2S = HalfT0 + T1 + (T2 >> 1);

        break;
      default: /* Process for all other cases, Sector F = 5. */
        CCU8_MODULE_PHASE_U->CR1S = 0U;
        CCU8_MODULE_PHASE_U->CR2S = (uint32_t) HalfT0;

        CCU8_MODULE_PHASE_V->CR1S = 0U;
        CCU8_MODULE_PHASE_V->CR2S = (uint32_t) (PERIOD_OF_PWM + T1nT2) >> 1U;

        CCU8_MODULE_PHASE_W->CR1S = 0U;
        CCU8_MODULE_PHASE_W->CR2S = (uint32_t) HalfT0 + T2;

        CCU80_CC83->CR1S = HalfT0 + (T2 >> 1);      // For ADC trigger at centre of active segments T1 and T2.
        CCU80_CC83->CR2S = HalfT0 + T2 + (T1 >> 1);

        break;
    } /* End of switch (SVM.CurrentSectorNo), standard 7-segment symmetric PWM. */

  }
  /* Enable shadow transfer for slice 0,1,2 for CCU80 Kernel. */
  CCU8_MODULE->GCSS |= (uint32_t)(XMC_CCU8_SHADOW_TRANSFER_SLICE_0|XMC_CCU8_SHADOW_TRANSFER_SLICE_1|XMC_CCU8_SHADOW_TRANSFER_SLICE_2|XMC_CCU8_SHADOW_TRANSFER_SLICE_3 );
 }
#else
/* API to update SVPWM CCU8 duty cycles, use standard SVM (7-segment symmetric PWM) */
__attribute__((section(".ram_code"))) void pmsm_foc_svpwm_update(uint16_t Amplitude, uint16_t Angle)
{

  /* SVM time T1, T2. */
  uint16_t T1;
  uint16_t T2;
  uint16_t T1nT2;               /* Time (T1+T2). */
  uint16_t T0;

  uint16_t AngleTemp;
  uint16_t SectorAngle;

  SVM.PreviousSectorNo = SVM.CurrentSectorNo;           /* Record sector information of last PWM cycle. */

  /* Angle: 0 ~ 2^16 represent electrical angle 0° ~ 360°. Or = (uint16_t)(Angle >> 8) * 6; */
  AngleTemp = (Angle >> ANGLETEMP_SHIFT) * 6U;
  SectorAngle = AngleTemp & SECTOR_ANGLE_AND;					/* Relative angle θrel in each sector. */
  SVM.CurrentSectorNo = AngleTemp >> SECTOR_NO_SHIFT; /* Update new SVM sector number. Or = (AngleTemp >> 8) & 0x7U; */

  /* Calculate T1 / T2 by LUT. */
  T1 = (((Amplitude * Sinus60_tab[MAX_LUT_INDEX - SectorAngle]) >> 15) * SVM_LUT_SCALE) >> 15;
  T2 = (((Amplitude * Sinus60_tab[SectorAngle]) >> 15) * SVM_LUT_SCALE) >> 15;

  T1nT2 = T1 + T2;												/* Temp variable for (T1+T2) <= PERIOD_REG. */


//  /* Overmodulation from Deyun */
//  if (T1nT2 > PERIOD_REG)
//  {
//    T1nT2 = PERIOD_REG;       /* Make sure below T0/2 >= 0. */
//  }

  if (T1nT2 > PERIOD_OF_PWM)
  {
    #define SHIFT_OVERMODULATION    (5U)
    MATH->DIVCON = (0x00008004 | (SHIFT_OVERMODULATION << 16U) | (SHIFT_OVERMODULATION << 8U));
    MATH->DVD = T1 * PERIOD_OF_PWM;
    MATH->DVS = T1nT2;

    T1nT2 = PERIOD_OF_PWM;

    while (MATH->DIVST)
    {
      /* CPU wait */
    }

    T1 = MATH->QUOT;
    T2 = PERIOD_OF_PWM - T1;

  }

  T0 = PERIOD_OF_PWM - T1nT2;

#if(CURRENT_SENSING == USER_THREE_SHUNT_SYNC_CONV)
  if (T0 > T0_THRESHOLD)
  {
    SVM.Flag_3or2_ADC = USE_ALL_ADC;			/* To use all (e.g.: three) ADC samplings for current reconstruction. */
  }
  else
  {
    SVM.Flag_3or2_ADC = USE_2_ADC;				/* To use two ADC samplings for current reconstruction. */
  }
#endif

#if(SVM_SWITCHING_SCHEME == STANDARD_SVM_7_SEGMENT)
  /* 7-segment SVM, T0, T0_111 for first [111], T0_111 + T1/2, T0_111 + T2/2, T0_111 + (T1+T2)/2. */
  uint16_t T0_111;
  uint16_t T0nHalfT1;
  uint16_t T0nHalfT2;
  uint16_t T0nHalfT1nT2;

  T0_111 = T0 >> RATIO_T0_111;												/* T0_111, time of first [111]. */
  T0nHalfT1 = (T0 + (uint16_t)(T1 << (RATIO_T0_111 - 1U))) >> RATIO_T0_111;				/* T0_111 + T1/2. */
  T0nHalfT2 = (T0 + (uint16_t)(T2 << (RATIO_T0_111 - 1U))) >> RATIO_T0_111;				/* T0_111 + T2/2. */
  T0nHalfT1nT2 = (T0 + (uint16_t)((T1 + T2) << (RATIO_T0_111 - 1U))) >> RATIO_T0_111;	/* T0_111 + (T1+T2)/2. */

  /* Standard 7-segment symmetric PWM: */
  switch (SVM.CurrentSectorNo)
  {
    case 0:														/* Sector A */
      CCU8_MODULE_PHASE_U->CR1S = (uint32_t) T0nHalfT1nT2;
      CCU8_MODULE_PHASE_U->CR2S = (uint32_t) (PERIOD_OF_PWM - T0nHalfT1nT2);

      CCU8_MODULE_PHASE_V->CR1S = (uint32_t) T0nHalfT2;
      CCU8_MODULE_PHASE_V->CR2S = (uint32_t) (PERIOD_OF_PWM - T0nHalfT2);

      CCU8_MODULE_PHASE_W->CR1S = (uint32_t) T0_111;
      CCU8_MODULE_PHASE_W->CR2S = (uint32_t) (PERIOD_OF_PWM - T0_111);

      break;
    case 1:														/* Sector B */

      CCU8_MODULE_PHASE_U->CR1S = (uint32_t) T0nHalfT1;
      CCU8_MODULE_PHASE_U->CR2S = (uint32_t) (PERIOD_OF_PWM - T0nHalfT1);

      CCU8_MODULE_PHASE_V->CR1S = (uint32_t) T0nHalfT1nT2;
      CCU8_MODULE_PHASE_V->CR2S = (uint32_t) (PERIOD_OF_PWM - T0nHalfT1nT2);

      CCU8_MODULE_PHASE_W->CR1S = (uint32_t) T0_111;
      CCU8_MODULE_PHASE_W->CR2S = (uint32_t) (PERIOD_OF_PWM - T0_111);

      break;
    case 2:														/* Sector C */
      CCU8_MODULE_PHASE_U->CR1S = (uint32_t) T0_111;
      CCU8_MODULE_PHASE_U->CR2S = (uint32_t) (PERIOD_OF_PWM - T0_111);

      CCU8_MODULE_PHASE_V->CR1S = (uint32_t) T0nHalfT1nT2;
      CCU8_MODULE_PHASE_V->CR2S = (uint32_t) (PERIOD_OF_PWM - T0nHalfT1nT2);

      CCU8_MODULE_PHASE_W->CR1S = (uint32_t) T0nHalfT2;
      CCU8_MODULE_PHASE_W->CR2S = (uint32_t) (PERIOD_OF_PWM - T0nHalfT2);

      break;
    case 3:														/* Sector D */

      CCU8_MODULE_PHASE_U->CR1S = (uint32_t) T0_111;
      CCU8_MODULE_PHASE_U->CR2S = (uint32_t) (PERIOD_OF_PWM - T0_111);

      CCU8_MODULE_PHASE_V->CR1S = (uint32_t) T0nHalfT1;
      CCU8_MODULE_PHASE_V->CR2S = (uint32_t) (PERIOD_OF_PWM - T0nHalfT1);

      CCU8_MODULE_PHASE_W->CR1S = (uint32_t) T0nHalfT1nT2;
      CCU8_MODULE_PHASE_W->CR2S = (uint32_t) (PERIOD_OF_PWM - T0nHalfT1nT2);

      break;
    case 4:														/* Sector E */
      CCU8_MODULE_PHASE_U->CR1S = (uint32_t) T0nHalfT2;
      CCU8_MODULE_PHASE_U->CR2S = (uint32_t) (PERIOD_OF_PWM - T0nHalfT2);

      CCU8_MODULE_PHASE_V->CR1S = (uint32_t) T0_111;
      CCU8_MODULE_PHASE_V->CR2S = (uint32_t) (PERIOD_OF_PWM - T0_111);

      CCU8_MODULE_PHASE_W->CR1S = (uint32_t) T0nHalfT1nT2;
      CCU8_MODULE_PHASE_W->CR2S = (uint32_t) (PERIOD_OF_PWM - T0nHalfT1nT2);

      break;
    default:													/* Process for all other cases, Sector F = 5. */
      CCU8_MODULE_PHASE_U->CR1S = (uint32_t) T0nHalfT1nT2;
      CCU8_MODULE_PHASE_U->CR2S = (uint32_t) (PERIOD_OF_PWM - T0nHalfT1nT2);

      CCU8_MODULE_PHASE_V->CR1S = (uint32_t) T0_111;
      CCU8_MODULE_PHASE_V->CR2S = (uint32_t) (PERIOD_OF_PWM - T0_111);

      CCU8_MODULE_PHASE_W->CR1S = (uint32_t) T0nHalfT1;
      CCU8_MODULE_PHASE_W->CR2S = (uint32_t) (PERIOD_OF_PWM - T0nHalfT1);


      break;
  }	/* End of switch (SVM.CurrentSectorNo), standard 7-segment symmetric PWM. */


#elif(SVM_SWITCHING_SCHEME == STANDARD_SVM_5_SEGMENT)
      /* 5-segment SVM, (T1+T2)/2, T2/2, T1/2 */
      uint16_t Half_T1nT2;
      uint16_t Half_T2;
      uint16_t Half_T1;

      Half_T1nT2 = T1nT2 >> 1;                // (T1+T2)/2.
      Half_T2 = T2 >> 1;                    // T2/2.
      Half_T1 = T1 >> 1;                    // T1/2.

      /* Standard 5-segment symmetric PWM: */
      switch (SVM.CurrentSectorNo)
      {
        case 0:                        // Sector A
          CCU8_MODULE_PHASE_U->CR1S = (uint32_t) Half_T1nT2;
          CCU8_MODULE_PHASE_U->CR2S = (uint32_t) (PERIOD_OF_PWM - Half_T1nT2);

          CCU8_MODULE_PHASE_V->CR1S = (uint32_t) Half_T2;
          CCU8_MODULE_PHASE_V->CR2S = (uint32_t) (PERIOD_OF_PWM - Half_T2);

          CCU8_MODULE_PHASE_W->CR1S = (uint32_t) 0;
          CCU8_MODULE_PHASE_W->CR2S = (uint32_t) (PERIOD_OF_PWM + 1);

        break;

      case 1:                       // Sector B
        CCU8_MODULE_PHASE_U->CR1S = (uint32_t) Half_T1;
        CCU8_MODULE_PHASE_U->CR2S = (uint32_t) (PERIOD_OF_PWM - Half_T1);

