Infineon/REF_MTB_LV_Ceiling_Fan/CF_SL_FOC_XMC13/PMSM_FOC/MIDSys/pmsm_foc_pwmsvm.c
        CCU8_MODULE_PHASE_V->CR1S = (uint32_t) Half_T1nT2;
        CCU8_MODULE_PHASE_V->CR2S = (uint32_t) (PERIOD_OF_PWM - Half_T1nT2);

        CCU8_MODULE_PHASE_W->CR1S = (uint32_t) 0;
        CCU8_MODULE_PHASE_W->CR2S = (uint32_t) (PERIOD_OF_PWM + 1);

        break;

      case 2:                       // Sector C
        CCU8_MODULE_PHASE_U->CR1S = (uint32_t) 0;
        CCU8_MODULE_PHASE_U->CR2S = (uint32_t) (PERIOD_OF_PWM + 1);

        CCU8_MODULE_PHASE_V->CR1S = (uint32_t) Half_T1nT2;
        CCU8_MODULE_PHASE_V->CR2S = (uint32_t) (PERIOD_OF_PWM - Half_T1nT2);

        CCU8_MODULE_PHASE_W->CR1S = (uint32_t) Half_T2;
        CCU8_MODULE_PHASE_W->CR2S = (uint32_t) (PERIOD_OF_PWM - Half_T2);

        break;

      case 3:                       // Sector D

        CCU8_MODULE_PHASE_U->CR1S = (uint32_t) 0;
        CCU8_MODULE_PHASE_U->CR2S = (uint32_t) (PERIOD_OF_PWM + 1);

        CCU8_MODULE_PHASE_V->CR1S = (uint32_t) Half_T1;
        CCU8_MODULE_PHASE_V->CR2S = (uint32_t) (PERIOD_OF_PWM - Half_T1);

        CCU8_MODULE_PHASE_W->CR1S = (uint32_t) Half_T1nT2;
        CCU8_MODULE_PHASE_W->CR2S = (uint32_t) (PERIOD_OF_PWM - Half_T1nT2);

        break;

      case 4:                       // Sector E

        CCU8_MODULE_PHASE_U->CR1S = (uint32_t) Half_T2;
        CCU8_MODULE_PHASE_U->CR2S = (uint32_t) (PERIOD_OF_PWM - Half_T2);

        CCU8_MODULE_PHASE_V->CR1S = (uint32_t) 0;
        CCU8_MODULE_PHASE_V->CR2S = (uint32_t) (PERIOD_OF_PWM + 1);

        CCU8_MODULE_PHASE_W->CR1S = (uint32_t) Half_T1nT2;
        CCU8_MODULE_PHASE_W->CR2S = (uint32_t) (PERIOD_OF_PWM - Half_T1nT2);

        break;

      default:                      // Process for all other cases. Sector F.

        CCU8_MODULE_PHASE_U->CR1S = (uint32_t) Half_T1nT2;
        CCU8_MODULE_PHASE_U->CR2S = (uint32_t) (PERIOD_OF_PWM - Half_T1nT2);

        CCU8_MODULE_PHASE_V->CR1S = (uint32_t) 0;
        CCU8_MODULE_PHASE_V->CR2S = (uint32_t) (PERIOD_OF_PWM + 1);

        CCU8_MODULE_PHASE_W->CR1S = (uint32_t) Half_T1;
        CCU8_MODULE_PHASE_W->CR2S = (uint32_t) (PERIOD_OF_PWM - Half_T1);

        break;
      }

#endif
  /* Enable shadow transfer for slice 0,1,2 for CCU80 Kernel. */
  CCU8_MODULE->GCSS |= (uint32_t)(XMC_CCU8_SHADOW_TRANSFER_SLICE_0|XMC_CCU8_SHADOW_TRANSFER_SLICE_1|XMC_CCU8_SHADOW_TRANSFER_SLICE_2);
  /* ADC triggered always at centre of [000] (fixed centre position in one PWM). */
}
#endif

#define USER_SCALE_UP_SINE_LUT                      (2U)                                /*!<   0U,1U 2U */
/* !!!! API to update SVPWM CCU8 duty cycles for TRANSITION STATE ONLY !!!! */
__attribute__((section(".ram_code"))) void PMSM_FOC_SVPWM_Update_Singleshunt_Trans(uint16_t amplitude, uint16_t angle)
{
  /* SVM time T1, T2. */
  uint16_t T1;
  uint16_t T2;


  /* Time (T1+T2+2Tz) */
  uint16_t T1T2n2Tz;

  /* Time of zero vector [000], i.e.: first portion of T0, and Ts - T0_111. */
  uint16_t T0_000;
  uint16_t Period_T0_111;

  uint16_t angle_temp;
  uint16_t sector_angle;

  SVM.PreviousSectorNo = SVM.CurrentSectorNo;           /* Record sector information of last PWM cycle. */

  /* Angle: 0 ~ 2^16 represent electrical angle 0° ~ 360°. Or = (uint16_t)(Angle >> 8) * 6; */
  angle_temp = (angle >> ANGLETEMP_SHIFT) * 6U;
  sector_angle = angle_temp & SECTOR_ANGLE_AND;         /* Relative angle θrel in each sector. */
  SVM.CurrentSectorNo = angle_temp >> SECTOR_NO_SHIFT; /* Update new SVM sector number. Or = (AngleTemp >> 8) & 0x7U; */

  /* Calculate T1 / T2 by LUT. */
//  T1 = (((amplitude * SIN60_TAB[MAX_LUT_INDEX - sector_angle]) >> 15) * SVM_LUT_SCALE) >> 15;
//  T2 = (((amplitude * SIN60_TAB[sector_angle]) >> 15) * SVM_LUT_SCALE) >> 15;
  /* Calculate T1 / T2 by LUT. Ts is scaled in SIN60_TAB */
  T1 = ((amplitude * Sinus60_tab[MAX_LUT_INDEX - sector_angle]) >> (15 + USER_SCALE_UP_SINE_LUT));
  T2 = ((amplitude * Sinus60_tab[sector_angle]) >> (15 + USER_SCALE_UP_SINE_LUT));

  T1 += TZ_PZV; /* Add Tz, the time of Pseudo Zero Vectors. Fig 20 in FOC app note */
  T2 += TZ_PZV;

  T1T2n2Tz = T1 + T2 + TZ_PZVX2;

  if (T1T2n2Tz > PERIOD_REG)
  {
    T1T2n2Tz = PERIOD_REG; /* Make sure below T0/2 >= 0 and Ts-T0/2 <= Ts. */
  }

  T0_000 = (PERIOD_REG - T1T2n2Tz) >> 1U; /* T0_000 = T0/2. */
  Period_T0_111 = (PERIOD_REG + T1T2n2Tz) >> 1U; /* Temp variable for Ts-T0/2. */

  /* To use 6-segment (with two Tz at beginning) switching sequences of SVM with Pseudo Zero Vectors (PZV)*/
  switch (SVM.CurrentSectorNo)
  {
    case 0: /* Sector A */
		CCU8_MODULE_PHASE_U->CR1S = 0;
    	CCU8_MODULE_PHASE_U->CR2S = TZ_PZVX2 + T0_000;
    	CCU8_MODULE_PHASE_V->CR1S = TZ_PZV;
    	CCU8_MODULE_PHASE_V->CR2S = Period_T0_111 - T2;
    	CCU8_MODULE_PHASE_W->CR1S = TZ_PZVX2;
    	CCU8_MODULE_PHASE_W->CR2S = Period_T0_111;
    	break;

    case 1: /*Sector B */

    	CCU8_MODULE_PHASE_U->CR1S = TZ_PZV;
    	CCU8_MODULE_PHASE_U->CR2S = Period_T0_111 - T1;
    	CCU8_MODULE_PHASE_V->CR1S = 0;
    	CCU8_MODULE_PHASE_V->CR2S = TZ_PZVX2 + T0_000;
    	CCU8_MODULE_PHASE_W->CR1S = TZ_PZVX2;
    	CCU8_MODULE_PHASE_W->CR2S = Period_T0_111;
    	break;

    case 2: /* Sector C */
    	CCU8_MODULE_PHASE_U->CR1S = TZ_PZVX2;
    	CCU8_MODULE_PHASE_U->CR2S = Period_T0_111;
    	CCU8_MODULE_PHASE_V->CR1S = 0;
    	CCU8_MODULE_PHASE_V->CR2S = TZ_PZVX2 + T0_000;
    	CCU8_MODULE_PHASE_W->CR1S = TZ_PZV;
    	CCU8_MODULE_PHASE_W->CR2S = Period_T0_111 - T2;
    	break;

    case 3: /* Sector D */
    	CCU8_MODULE_PHASE_U->CR1S = TZ_PZVX2;
    	CCU8_MODULE_PHASE_U->CR2S = Period_T0_111;
    	CCU8_MODULE_PHASE_V->CR1S = TZ_PZV;
    	CCU8_MODULE_PHASE_V->CR2S = Period_T0_111 - T1;
    	CCU8_MODULE_PHASE_W->CR1S = 0;
    	CCU8_MODULE_PHASE_W->CR2S = TZ_PZVX2 + T0_000;
      break;

    case 4: /* Sector E */
    	CCU8_MODULE_PHASE_U->CR1S = TZ_PZV;
    	CCU8_MODULE_PHASE_U->CR2S = Period_T0_111 - T2;
    	CCU8_MODULE_PHASE_V->CR1S = TZ_PZVX2;
    	CCU8_MODULE_PHASE_V->CR2S = Period_T0_111;
    	CCU8_MODULE_PHASE_W->CR1S = 0;
    	CCU8_MODULE_PHASE_W->CR2S = TZ_PZVX2 + T0_000;
      break;

    default: /* Process for all other cases, Sector F = 5. */
    	CCU8_MODULE_PHASE_U->CR1S = 0;
    	CCU8_MODULE_PHASE_U->CR2S = TZ_PZVX2 + T0_000;
    	CCU8_MODULE_PHASE_V->CR1S = TZ_PZVX2;
    	CCU8_MODULE_PHASE_V->CR2S = Period_T0_111;
    	CCU8_MODULE_PHASE_W->CR1S = TZ_PZV;
    	CCU8_MODULE_PHASE_W->CR2S = Period_T0_111 - T1;
      break;
  }
  /* Enable shadow transfer for slice 0,1,2 for CCU80 Kernel. */
  CCU8_MODULE->GCSS |= (uint32_t)(XMC_CCU8_SHADOW_TRANSFER_SLICE_0|XMC_CCU8_SHADOW_TRANSFER_SLICE_1|XMC_CCU8_SHADOW_TRANSFER_SLICE_2|XMC_CCU8_SHADOW_TRANSFER_SLICE_3 );
}
